data = {
    (1, 2, 3, 6, 7): {
        "Институт экономики и управления": {
            'Экономика (38.03.01)': ['Прикладная экономика (очная)', 'Бухгалтерский учет, анализ и аудит (очно-заочная)']
        }
    },
    (1, 2, 4, 6, 7): {
        "Институт экономики и управления": {
            'Менеджмент (38.03.02, очно/очно-заочное)': ['Кадровый менеджмент и управление бизнесом'],
            'Гос. и муниципальное управление (38.03.04, очно/очно-заочное)': ['Региональное и муниципальное управление']
        }
    },
    (1, 3, 6, 9): {
        "Химический факультет": {
            'Экология и природопользование (05.03.06, очно)': ['Экологический мониторинг']
        },
        "Институт математики и информатики": {
            'Прикладная мат. и информатика (01.03.02, очно)': ['Мат. и комп. моделирование'],
            'Мат. обеспечение и администрирование инф. систем (02.03.03, очно)': ['Инф. системы и базы данных/методы и технологии ИИ'],
            'Прикладная информатика (09.03.03, очно)': ['Проектирование и внедрение инф. систем']
        },
        "Физико-технический факультет": {
            'Информационные системы и технологии (09.03.02, очно)': ['Информационные системы и технологии'],
            'Энергетическое машиностроение (13.03.03, очно)': ['Двигатели внутреннего сгорания'],
            'Физика (03.03.02, очно)': ['Физика конденсированного состояния']
        },
        "Факультет биологии, географии и землепользования": {
            'Геодезия и дистанционное зондирование (21.03.03, очно)': [],
            'География (05.03.02, очно)': ['Экономическая и социальная география, региональный туризм']
        }
    },
    (1, 6, 8, 10): {
        "Химический факультет": {
            'Теоретическая и прикладная химия (04.03.01, очно)': []
        },
        "Факультет биологии, географии и землепользования": {
            'Общая биология (06.03.01, очно)': []
        }
    },
    (1, 6, 9, 11): {
        "Химический факультет": {
            'Геология (05.03.01, очно)': []
        }
    },
    (1, 6, 8, 10, 11): {
        "Факультет биологии, географии и землепользования": {
            'Педагогическое образование (44.03.01, заочно)': ['Биология']
        }
    },
    (1, 8): {
        "Медицинский институт": {
            'Лечебное дело (31.05.01, очно)': ['Врач-лечебник'],
            'Фармация (33.05.01, очно)': ['Провизор']
        }
    },
    (1, 4, 7): {
        "Восточный институт": {
            'Востоковедение и африканистика (41.03.03, очно)': [
                'Языки и литература стран Азии и Африки/филология: Центральной Азии (монгольский, китайский)',
                'Дальнего Востока (корейский, китайский)',
                'Дальнего Востока (японский, китайский)',
                'Дальнего Востока (китайский, японский)',
                'История стран Азии и Африки (китайский, японский)',
                'Социально-экономическое развитие стран Азии и Африки (китайский, корейский)'
            ],
            'Педагогическое образование с двумя профилями подготовки (44.03.05, очно)': [
                'Родной языки литература, русский язык']
        },
        "Исторический факультет": {
            'Социология (39.03.01, очно)': ['Социальная теория и прикладное социальное знание'],
            'Политология (41.03.04, очно)': ['Сравнительная политология, политическая регионалистика и этнополитика'],
            'История (46.03.01, очно)': ['Теория и практика исторических исследований'],
            'Теология (48.03.01, очно)': ['Православная теология. Государственно-конфессиональные отношения'],
            'Педагогическое образование с двумя профилями подготовки (44.03.05, очно)': ['История и обществознание']
        },
        "Институт филологии и массовых коммуникаций": {
            'Филология (45.03.01)': ['Преподавание филологических дисциплин (русский язык и литература) (очная/заочная)', 'Преподавание филологических дисциплин (иностранные языки) (заочная)'],
            'Журналистика (42.03.02, очно/заочно)': ['Газетное дело и Интернет-журналистика'],
            'Педагогическое образование с двумя профилями подготовки (42.03.05, очно)': ['Иностранные языки'],
            'Лингвистика (45.03.02, очно)': ['Перевод и переводоведение']
        },
        "Институт математики и информатики": {
            'Педагогическое образование с двумя профилями подготовки (44.03.05, очно)': ['Математика и физика']
        },
        "Социально-психологический факультет": {
            'Социальная работа (39.03.02, очная/заочная)': []
        },
        "Факультет физической культуры, спорта и туризма": {
            'Педагогическое образование с двумя профилями подготовки (4.03.05, очно)': ['История и обществознание'],
            'Педагогическое образование (44.03.01, заочно)': ['Физическая культура']
        },
        "Педагогический институт": {
            'Педагогическое образование (44.03.01, заочно)': ['Музыкальное образование', 'Начальное образование', 'Технологическое образование'],
            'Профессиональное обучение (по отраслям) (44.03.04, заочно)': ['Декоративно-прикладное искусство и дизайн'],
            'Педагогическое образование с двумя профилями подготовки (44.03.05, очно)': [
                'Начальное образование и русский язык',
                'Технология и информатика',
                'Дошкольное образование и иностранный язык'
            ]
        },
        "Юридический факультет": {
            'Юриспруденция (40.03.01)': ['Юриспруденция (очная/очно-заочная)', 'Международно-правовой профиль (очная)']
        }
    },
    (1, 2, 4, 7): {
        "Институт филологии и массовых коммуникаций": {
            'Лингвистика (45.03.02, очно)': ['Перевод и переводоведение'],
            'Реклама и связи с общественностью (42.03.01, заочно)': ['Реклама и связи с общественностью']
        },
        "Восточный институт": {
            'Востоковедение и африканистика (41.03.03, очно)': [
                'Языки и литература стран Азии и Африки/филология: Центральной Азии (монгольский, китайский)',
                'Дальнего Востока (корейский, китайский)',
                'Дальнего Востока (японский, китайский)',
                'Дальнего Востока (китайский, японский)'
            ]
        }
    },
    (1, 2, 7): {
        "Восточный институт": {
            'Зарубежное регионоведение (41.03.01, очно)': ['Азиатские исследования']
        }
    },
    (1, 6, 7): {
        "Педагогический институт": {
            'Педагогическое образование (44.03.01, заочно)': ['Начальное образование', 'Технологическое образование']
        }
    },
    (1, 7, 8): {
        "Педагогический институт": {
            'Педагогическое образование (44.03.01, заочно)': ['Дошкольное образование']
        }
    },
    (1, 6): {
        "Педагогический институт": {
            'Профессиональное обучение (по отраслям) (44.03.04, заочно)': ['Декоративно-прикладное искусство и дизайн']
        }
    }
}
